Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБСВМММ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета7</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РасположениеФирм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>РасположениеФирм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Организации/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СохранитьОрганизацию(СтрокаОтвета, Перезаписывать = Ложь) Экспорт
	
	ЭтоНовый = Ложь;
	Если ЗначениеЗаполнено(СтрокаОтвета.ИНН) Тогда
		спр = Справочники.Организации.НайтиПоРеквизиту("ИНН", СтрокаОтвета.ИНН);
	Иначе
		спр = Справочники.Организации.НайтиПоНаименованию(СтрокаОтвета.Наименование);	
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(спр) Тогда
		спр = Справочники.Организации.СоздатьЭлемент();
		ЭтоНовый = Истина;
	Иначе
		спр = спр.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(спр, СтрокаОтвета);	
	
	Если НЕ ЭтоНовый И НЕ Перезаписывать Тогда
		Возврат спр.Ссылка;
	КонецЕсли;	
	
	Попытка
		спр.Записать();
		Возврат спр.Ссылка;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;	
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиОрганизацию(СтрокаОтвета, Перезаписывать = Ложь) Экспорт
	
	ЭтоНовый = Ложь;
	Если ЗначениеЗаполнено(СтрокаОтвета.ИНН) Тогда
		Возврат Справочники.Организации.НайтиПоРеквизиту("ИНН", СтрокаОтвета.ИНН);
	Иначе
		Возврат Справочники.Организации.НайтиПоНаименованию(СтрокаОтвета.Наименование);	
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции


Процедура ЗаписатьРасположениеФирм(Организация, Сервер, ИмяБазы, Логин, Пароль) Экспорт
	
	Менеджер = РегистрыСведений.РасположениеФирм.СоздатьМенеджерЗаписи();
	Менеджер.Период = НачалоДня(ТекущаяДатаСеанса());
	Менеджер.Организация = Организация;
	Менеджер.Прочитать();
	Менеджер.Сервер = Сервер;
	Менеджер.ИмяБазы = ИмяБазы;
	Менеджер.Логин = Логин;
	Менеджер.Пароль = Пароль;
	Менеджер.Период = НачалоДня(ТекущаяДатаСеанса());
	Менеджер.Организация = Организация;
	
	Менеджер.Записать();
	
КонецПроцедуры	

#КонецОБласти
